In [145]:
import pandas as pd

In [146]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

In [147]:
purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [148]:
m=purchases['oranges']

In [149]:
n=purchases[['oranges']]

In [150]:
type(n)

pandas.core.frame.DataFrame

In [151]:
purchases1 = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

In [152]:
purchases1

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [153]:
purchases1.loc['Lily']

apples     0
oranges    7
Name: Lily, dtype: int64

In [154]:
purchases.columns

Index(['apples', 'oranges'], dtype='object')

In [155]:
import os

In [156]:
os.getcwd()

'/Users/misky/Desktop/DATA SCIENCE 2020'

In [157]:
movies=pd.read_csv("imdb.csv", index_col='Rank')

In [158]:
movies.head(2)

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0

In [159]:
data2=pd.read_json('http://jsonplaceholder.typicode.com/todos')

In [160]:
data2.head(5)

   userId  id                                              title  completed
0       1   1                                 delectus aut autem      False
1       1   2                 quis ut nam facilis et officia qui      False
2       1   3                                fugiat veniam minus      False
3       1   4                                   et porro tempora       True
4       1   5  laboriosam mollitia et enim quasi adipisci qui...      False

In [161]:
data3=data2.set_index('id')

In [162]:
data3

     userId                                              title  completed
id
1         1                                 delectus aut autem      False
2         1                 quis ut nam facilis et officia qui      False
3         1                                fugiat veniam minus      False
4         1                                   et porro tempora       True
5         1  laboriosam mollitia et enim quasi adipisci qui...      False
..      ...                                                ...        ...
196      10                consequuntur aut ut fugit similique       True
197      10                  dignissimos quo nobis earum saepe       True
198      10                       quis eius est sint explicabo       True
199      10                       numquam repellendus a magnam       True
200      10                       ipsam aperiam voluptates qui      False

[200 rows x 3 columns]

In [163]:
import psycopg2 as ps

In [164]:
conn=ps.connect("dbname=sales_demo user=postgres host=localhost password=Miskitoo.1998")

In [165]:
query="select * from inventories"

In [166]:
new_purchases=pd.read_sql(query,conn)

In [167]:
new_purchases.head(2)

   id                 name        type      bp      sp
0   1  Pork - Suckling Pig  vegetables  175.52  245.73
1   2    Lid - 3oz Med Rec      Drinks  182.48  255.47

In [168]:
new_purchases.to_csv('new_new_purchases.csv')

In [169]:
!pip3 install SQLAlchemy

Requirement already satisfied: SQLAlchemy in /Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages (1.3.13)
You are using pip version 18.1, however version 20.0.2 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [193]:
from sqlalchemy import create_engine

In [197]:
engine=create_engine("postgresql://postgres:Miskitoo.1998@localhost:5432/sales_demo")

In [200]:
data3.to_sql('dataaj', engine)

AttributeError: 'Engine' object has no attribute 'cursor'

In [172]:
data2.head()

   userId  id                                              title  completed
0       1   1                                 delectus aut autem      False
1       1   2                 quis ut nam facilis et officia qui      False
2       1   3                                fugiat veniam minus      False
3       1   4                                   et porro tempora       True
4       1   5  laboriosam mollitia et enim quasi adipisci qui...      False

In [173]:
connection = engine.raw_connection()
data2.to_sql('data', connection,index=False, if_exists='append')

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': relation "sqlite_master" does not exist
LINE 1: SELECT name FROM sqlite_master WHERE type='table' AND name=?...
                         ^

In [ ]:
data2.to_sql('test_salebs',engine)